
# 点击开始
click_Start = [492,2298,761,2394]
Load = []
# 点击关闭
X_CLOSE = [611,2344,658,2391]

# 元气使用

# 点击头像
ICON=[67,149,128,243]
# 点击元气使用
yuanqishiyong = [965, 1335, 1098, 1396]
yuanqishibie = [521,1640,615,1693]
# 点击兑换 * 20，双击
yuanqiduihuan = [954, 1627, 1097, 1700]
# 点击关闭
X_CLOSE_color_detail = "617,2350,#FFFFFF|644,2349,#FFFFFF|617,2376,#FEFEFE|645,2376,#FEFEFE"

# 点击左上返回
# FindColors.find("100,172,#F9F1F3|61,205,#F9F1F4|100,242,#FBF1F4|110,208,#FFFFFF",rect=[33,152,132,275],diff=0.95)
BACK_CLOSE = [33,152,132,275]
BACK_CLOSE_color_detail = "100,172,#F9F1F3|61,205,#F9F1F4|100,242,#FBF1F4|110,208,#FFFFFF"


# 收集

COLLECTION = [1147, 941, 1226, 990]

# 点击金币
COLLECTION_JB = [1121,358,1143,388]

# 协会

UNION = [1144, 802, 1229, 849]
# 点击灵感碰撞
lingganpengzhuang = [26, 548, 674, 1029]
# 点击提交
TJ_1_SY = [302,850,445,929]
TJ_2_SS = [917,767,1053,843]
TJ_3_GX = [352,1707,498,1776]
TJ_4_CY = [1013,1640,1149,1714]
# 点击空白
#
# *5

# 点击开启企划（）
qihua = [831, 2570, 1186, 2680]
# 点击左上角返回

# 点击应援
yingyuan = [23, 1090, 336, 1393]

# 点击立刻应援（普通）
likeyingyuan = [741, 1086, 1100, 1182]


# 闪亮之旅

SHINING_JOURNEY = [923, 2189, 1105, 2293]

# 点击思绪漫步
sixumanbu = [700, 1203, 1181, 1384]
## 思绪漫步

# 点击每日练习
meirilianxi = [641, 1869, 960, 1982]

meirilianxi_lingqu = [743, 978, 887, 1063]
# 点击左上返回

# 点击日常事件簿
richangshijianbu = [851, 398, 1196, 611]
## 日常事件簿

# 点击金币
richangshijianbu_JB_rect = [63,2344,166,2447]
richangshijianbu_JB = [79, 2371, 152, 2414]
# 点击空白

# 点击一键领取
richangshijianbu_rect = [224,2246,440,2452]
richangshijianbu_YJLQ = [262, 2288, 392, 2411]
richangshijianbu_LQ = [465, 1557, 787, 1644]
# 点击空白

# 点击派遣
PQ_rect = [959,390,1228,2448]
PQ_1 = [994,740,1170,807]
PQ_2 = [990,1258,1166,1321]
PQ_3 = [991,1772,1161,1842]
PQ_4 = [991,2289,1168,2359]
# 点击一键派遣
YJPQ = [379,2577,734,2670]
# 点击确认派遣
QRPQ = [821,2574,1171,2673]
# *4
#
# 点击坐上返回

# 点击时尚对决
shishuangduijue = [637, 1496, 927, 1770]
pass
# 玩呐百科
wannabaike = [1020, 1464, 1214, 1688]
# 心意之期
xinyizhiqi = [200, 403, 745, 616]
# 点击代言女王
daiyannvwang = [132, 727, 495, 1149]

## 代言

# 点击每日宣传
meirixuanchuan = [1073, 2487, 1193, 2590]
# 点击开始宣传
kashixuanchuan = [475, 1786, 837, 1886]
# 点击空白 * 2

# 点击四大区域
SNE_1 = [744,893,1024,1129]
WST_2 = [881,1345,1176,1557]
YNS_3 = [452,1567,758,1766]
BBL_4 = [93,1268,382,1487]
# 点击一键拾取
yijianshiqu = [990, 2461, 1130, 2587]
daiyan = [920,2026,1103,2109]
# 点击空白 * 2
#
# 点击左上返回

# 点击代言管理（）
daiyanguanli = [754, 2497, 884, 2584]


# 盲盒

BLINDBOX = [13,860,209,1458]
BLINDBOX2 = [66,587,159,670]
BLINDBOX2_JB = [1117,315,1186,362]
# 好友

FRIEND = [25, 2124, 159, 2192]

# 点击summer
TALK_SUMMER = [246,300,1176,934]
# 点击领取
TALK_SUMMER_LQ = [924,840,1097,903]
# 点击空白

# 点击通讯录
TXL = [433,2552,556,2690]
# 点击一键赠送
TXL_yijianzengsong = [418, 2344, 771, 2434]
# 点击领取体力
TXL_LQtili = [831, 2342, 1194, 2440]
# 点击一键领取
TXL_YJLQ = [445,2042,807,2138]
# 点击空白
#
# 点击关闭

# 点击玩呐社区
wannashequ = [684,2641,853,2703]
# 点击金币
wannashequ_JB = [990, 179, 1067, 222]
# 点击空白
#
# 点击左上返回

# 全服礼物

GIFT = [167, 2016, 554, 2195]
# 点击左边开启
GIFT_LEFT = [259,1399,386,1518]
# 点击 空白
# 点击取消 / 发送
GIFT_CANLE = [212,1820,571,1916]
GIFT_SEND = [686,1815,1036,1906]
# 点击右边点击开启
GIFT_RIGHT= [877,1398,994,1511]

shop = [19,624,166,687]
shop_rect = [497,664,1275,2533]
buy = [664,2029,754,2082]

zhuiguang = [1053,2590,1200,2713]
zhuiguang_enter = [56,690,219,846]
zhuiguang_JB = [1152,299,1171,329]